### Dataset Info

The dataset is provided by the Food and Agriculture Organization of the United Nations

Features Of the Dataset :
- 'Area Code', 'Area', 
'Item Code', 
'Item', 
'Element Code', 
'Element',
'Unit', 
'Y2014', 
'Y2015', 
'Y2016', 
'Y2017', 
'Y2018'

In [1]:
# Importing Libraries.

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Load data
df = pd.read_csv("FoodBalanceSheets_E_Africa_NOFLAG.csv", encoding = "latin-1")
df.head(10)

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28
5,4,Algeria,2903,Vegetal Products,664,Food supply (kcal/capita/day),kcal/capita/day,2932.00,2958.00,2941.00,2921.00,2932.00
6,4,Algeria,2903,Vegetal Products,674,Protein supply quantity (g/capita/day),g/capita/day,67.14,67.38,67.37,66.11,67.10
7,4,Algeria,2903,Vegetal Products,684,Fat supply quantity (g/capita/day),g/capita/day,53.84,54.72,52.04,55.59,54.57
8,4,Algeria,2941,Animal Products,664,Food supply (kcal/capita/day),kcal/capita/day,444.00,421.00,431.00,421.00,390.00
9,4,Algeria,2941,Animal Products,674,Protein supply quantity (g/capita/day),g/capita/day,27.76,26.97,27.35,26.71,24.73

In [46]:
df.shape

(60943, 12)

In [47]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [35]:
# Checking unique countries list
df['Area'].unique()

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Cabo Verde', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', "Côte d'Ivoire", 'Djibouti', 'Egypt',
       'Eswatini', 'Ethiopia', 'Ethiopia PDR', 'Gabon', 'Gambia', 'Ghana',
       'Guinea', 'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Seychelles', 'Sierra Leone',
       'South Africa', 'Sudan', 'Sudan (former)', 'Togo', 'Tunisia',
       'Uganda', 'United Republic of Tanzania', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [36]:
# Number of unique countries
df['Area'].nunique()

49

In [48]:
countries = df['Area'].nunique()
print("Total number of unique countries in the dataset:", countries)

Total number of unique countries in the dataset: 49

### What is the total Protein supply quantity in Madagascar in 2015?

In [60]:
# Filtering for Madagascar and protein supply in the year 2015
df[(df['Area'] == 'Madagascar') & (df['Element'] == 'Protein supply quantity (g/capita/day)')]['Y2015']

# Create a variable
madagascar2015_protein_supply = df[(df['Area'] == 'Madagascar') & (df['Element'] == 'Protein supply quantity (g/capita/day)')]['Y2015']

In [61]:
# Finding the total protein supply using the .sum() method
madagascar2015_protein_supply.sum()

173.04999999999998

In [63]:
print("Total Protein supply quantity in Madagascar in 2015:", round(madagascar2015_protein_supply.sum(),2))

Total Protein supply quantity in Madagascar in 2015: 173.05

### What is the total sum of Wine produced in 2015 and 2018 respectively?

Hint:

Perform a groupby sum aggregation on ‘Item’

In [118]:
wine = df[df['Item'] == 'Wine']

In [119]:
wine.groupby('Item')['Y2015'].sum()

Item
Wine    4251.81
Name: Y2015, dtype: float64

In [120]:
wine.groupby('Item')['Y2018'].sum()

Item
Wine    4039.32
Name: Y2018, dtype: float64

In [121]:
# Using grouby and sum tomperform the groupby sum aggreagation
sum_of_wine_2015 = wine.groupby('Item')['Y2015'].sum().values[0]
sum_of_wine_2018 = wine.groupby('Item')['Y2018'].sum().values[0]

print("Total Sum of Wine produced in 2015:", sum_of_wine_2015)
print("Total Sum of Wine produced in 2018:", sum_of_wine_2018)

Total Sum of Wine produced in 2015: 4251.81
Total Sum of Wine produced in 2018: 4039.32

### Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the highest sum in 2017?

In [122]:
# Select columns 'Y2017' and 'Area'
columns = df[['Y2017', 'Area']]

In [123]:
# groupby operation on Area
sum_area_2017 = columns.groupby('Area')['Y2017'].sum()

In [127]:
# Finding the area with the highest sum in 2017
area_highest_sum_2017 = sum_area_2017.idxmax()
highest_sum_2017_value = sum_area_2017.max()

print(f"The area with the highest sum in 2017 is {area_highest_sum_2017} with a sum of {round(highest_sum_value_2017,1)}")

The area with the highest sum in 2017 is Nigeria with a sum of 1483268.2

In [128]:
## Another method of finding Answer
sum_area_2017.sort_values().index[48]

'Nigeria'

### Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the 7th lowest sum in 2017?

In [129]:
# Sort the sums in ascending order and finding the 7th lowest(so with index 6)
area_7th_lowest_sum_2017 = sum_area_2017.sort_values().index[6]
lowest_sum_value_2017 = sum_area_2017.sort_values().iloc[6]

print(f"The area with the 7th lowest sum in 2017 is {area_7th_lowest_sum_2017} with a sum of {lowest_sum_value_2017}.")

The area with the 7th lowest sum in 2017 is Guinea-Bissau with a sum of 19102.77.

### Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?

In [132]:
# Groupby operation on'Element' and sum for each year
sum_by_element = df.groupby('Element')[['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']].sum()

highest_sum_stock_variation_year = sum_by_element.loc['Stock Variation'].idxmax()
# Used idmax because the idxmax() method returns the index of the maximum value for each column.

print(f"The year with the highest sum of Stock Variation is {highest_sum_stock_variation_year}.")

The year with the highest sum of Stock Variation is Y2014.

### Which year had the least correlation with ‘Element Code’?

In [133]:
df[['Element Code', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']].corr()

              Element Code     Y2014     Y2015     Y2016     Y2017     Y2018
Element Code      1.000000  0.024457  0.023889  0.023444  0.024254  0.024279
Y2014             0.024457  1.000000  0.994647  0.996081  0.995230  0.994872
Y2015             0.023889  0.994647  1.000000  0.995739  0.988048  0.988208
Y2016             0.023444  0.996081  0.995739  1.000000  0.992785  0.992757
Y2017             0.024254  0.995230  0.988048  0.992785  1.000000  0.998103
Y2018             0.024279  0.994872  0.988208  0.992757  0.998103  1.000000

In [134]:
# Select columns 'Element Code' and the years
new_columns = df[['Element Code', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']]

In [135]:
# Calculate correlation coefficients
corr_element = new_columns.corr().loc['Element Code'][['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']]
corr_element

Y2014    0.024457
Y2015    0.023889
Y2016    0.023444
Y2017    0.024254
Y2018    0.024279
Name: Element Code, dtype: float64

In [136]:
#Least correlation
corr_element.idxmin()

'Y2016'

In [137]:
# Find the year with the least correlation
year_least_correlation = corr_element.idxmin()

print(f"The year with the least correlation with 'Element Code' is {year_least_correlation}.")

The year with the least correlation with 'Element Code' is Y2016.

### What is the total number and percentage of missing data in 2014 to 3 decimal places?

In [138]:
year2014 = df['Y2014']

# Total number of missing values in 2014
sum_missing_2014 = year2014.isnull().sum()
sum_missing_2014

1589

In [139]:
# Percentage of missing values
missing_2014_percent = (sum_missing_2014 / len(df)) * 100

In [140]:
round(missing_2014_percent,3)

2.607

In [141]:
# Answer
print(f"Total number of missing values in 2014: {sum_missing_2014}")
print(f"Percentage of missing values in 2014(3 decimal places): {round(missing_2014_percent,3)}%")

Total number of missing values in 2014: 1589
Percentage of missing values in 2014(3 decimal places): 2.607%

### What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?

In [142]:
# mean and standard deviation
mean_2017 = df[['Y2017']].mean().values[0]
std_dev_2017 = df[['Y2017']].std().values[0]

# Print the results
print(f"Mean for the year 2017: {round(mean_2017,2)}")
print(f"Standard Deviation for the year 2017: {round(std_dev_2017,2)}")

Mean for the year 2017: 140.92
Standard Deviation for the year 2017: 1671.86

### Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?

In [143]:
# Group by 'Element' and calculate the sum for 'Processing' in 2017
sum_processing_2017 = df[df['Element'] == 'Processing'].groupby('Element')['Y2017'].sum().values[0]

print(f"The total sum of 'Processing' in 2017 is {sum_processing_2017}")

The total sum of 'Processing' in 2017 is 292836.0

### Questions On Numpy Array, Lists, etc

### Selecting elements in bold and italics

In [144]:
# Selecting elements in bold and italics
array  = ([[94, 89, 63],

             [93, 92, 48],

             [92, 94, 56]])

array = np.array(array)

In [145]:
print(type(array))

<class 'numpy.ndarray'>

In [146]:
array[:2,1:]

array([[89, 63],
       [92, 48]])

### Assigning the element 8 from the list to a variable x

In [43]:
y = [(2, 4), (7, 8), (1, 5, 9)]
y[1][1]

8

In [44]:
x = y[1][1]
x

8

### Given the following python code, what would the output of the code give?

In [87]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

Answer = TypeError

### What would be the output for?

In [103]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'


### If you have the following list

lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = [‘Age’,’Nationality’,’Overall’]

### How do you create a pandas DataFrame using this list, to look like the table below?

In [110]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ["Age","Nationality","Overall"]

In [116]:
pd.DataFrame(lst, columns = col , index = [1,2,3])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [117]:
pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92